## 6. Pandas
### 파일 입출력

In [ ]:
import pandas as pd

In [ ]:
# csv 파일 불러오기
df = pd.read_csv("./dataset/practice_book_dataset.csv")
df.head()

In [ ]:
# 데이터 정보 확인
df.shape
df.dtypes
df.info()
df.describe()

In [ ]:
df["title"].head(10)
df[["title","author"]].head(10)

In [ ]:
mask = df["price"] >= 100
df[mask]
df.loc[mask,["title","price","avg_reviews"]]

In [11]:
# csv 파일 저장
df2 = df.copy()
df2["library"] = "seoul library"
df2.to_csv("./dataset/new_book_dataset.csv")

In [33]:
# excel 파을 불러오기
df = pd.read_excel("./dataset/practice_employee_dataset.xlsx")
df.head()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-04-08,141604,0.15,United States,Seattle,2021-10-16
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,1997-11-29,99975,0.00,China,Chongqing,NaT
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,2006-10-26,163099,0.20,United States,Chicago,NaT
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,2019-09-27,84913,0.07,United States,Chicago,NaT
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,1995-11-20,95409,0.00,United States,Phoenix,NaT

In [34]:
# excel(.xlsx) 파일 저장
df2 = df.copy() 
df2["Woking Period"] = 3
df2.head(10)
df2.to_csv("./dataset/new_employee_dataset.csv")

In [28]:
# df = pd.read_csv("./dataset/dataset2.xlsx")
# df.head()

# 특정 시트 불러오기
df_sheet = pd.read_excel("./dataset/dataset2.xlsx", sheet_name="테스트")
df_sheet.head()

          에너지원별(1) 에너지원별(2) 에너지원별(3) 에너지원별(4)
0       총발전량 (MWh)       소계       소계       소계
1              NaN     양수발전       소계       소계
2  신재생에너지 공급비중 (%)       소계       소계       소계
3              NaN    재생에너지       소계       소계
4              NaN     신에너지       소계       소계

In [27]:

df = pd.read_json("./dataset/practice_json.json")
df.head()

,squadName,homeTown,formed,secretBase,active,members
0,Super hero squad,Metro City,2016,Super tower,True,"{'name': 'Molecule Man', 'age': 29, 'secretIde..."
1,Super hero squad,Metro City,2016,Super tower,True,"{'name': 'Madame Uppercut', 'age': 39, 'secret..."
2,Super hero squad,Metro City,2016,Super tower,True,"{'name': 'Eternal Flame', 'age': 1000000, 'sec..."